Лицензия MIT с ограничением области применения

Copyright (c) 2025 KAZAK1984

Настоящим предоставляется бесплатное разрешение любому лицу, получающему копию
данного программного обеспечения и сопутствующей документации (далее «Программное обеспечение»),
использовать Программное обеспечение без ограничений, включая, но не ограничиваясь правами
на использование, копирование, изменение, объединение, публикацию, распространение, сублицензирование
и/или продажу копий Программного обеспечения, а также лицам, которым предоставляется данное
Программное обеспечение, при соблюдении следующих условий:

1. Уведомление об авторских правах и данное уведомление о разрешении должны быть включены во все
   копии или значительные части Программного обеспечения.

2. Данное программное обеспечение и любые производные работы на его основе НЕ МОГУТ БЫТЬ ИСПОЛЬЗОВАНЫ
   для создания, функционирования или поддержки Telegram-бота для Ульяновского Государственного Технического Университета
   (официальный сайт: https://ulstu.ru).

   Однако Программное обеспечение МОЖЕТ СВОБОДНО ИСПОЛЬЗОВАТЬСЯ для создания Telegram-ботов для любых
   других учебных заведений, организаций или целей.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ,
ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО КОНКРЕТНОМУ НАЗНАЧЕНИЮ
И НЕНАРУШЕНИЯ ПРАВ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО
ИСКАМ, ЗА УЩЕРБ ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ СИТУАЦИИ,
ВОЗНИКШИМ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
